{
  "BLOG_TITLE": "Angular 19",
  "WELCOME": "Welcome to the Angular 19!",
  "READ_MORE": "Read More",
  "POST_1_TITLE": "First Post",
  "POST_1_CONTENT": "This is the content of the first post.",
  "POST_2_TITLE": "Second Post",
  "POST_2_CONTENT": "This is the content of the second post.",
  "POST_3_TITLE": "Third Post",
  "POST_3_CONTENT": "This is the content of the third post.",
  "ANGULAR_19_TITLE": "Angular 19: Key Features and Enhancements",
  "ANGULAR_19_DESC": "Angular 19, released on November 19, 2024, introduces a suite of enhancements aimed at improving performance, developer experience, and modern web development practices.",
  "FEATURE_1": "Standalone Components by Default",
  "FEATURE_1_DESC": "Angular 19 makes standalone components the default, simplifying module management and enabling more modular and maintainable codebases.",
  "FEATURE_2": "Incremental Hydration (Developer Preview)",
  "FEATURE_2_DESC": "This feature allows partial hydration of server-rendered pages, enhancing performance by activating only necessary parts of the page on the client side.",
  "FEATURE_3": "Linked Signals and Signals API",
  "FEATURE_3_DESC": "The introduction of linked signals provides a more granular and efficient way to manage reactive state within applications.",
  "FEATURE_4": "Resource and rxResource APIs",
  "FEATURE_4_DESC": "These APIs streamline asynchronous data handling, offering improved mechanisms for data fetching and error handling in Angular applications.",
  "FEATURE_5": "Enhanced Server-Side Rendering (SSR)",
  "FEATURE_5_DESC": "Angular 19 brings improvements to SSR, including route-level render modes and better integration with tools like Firebase and Netlify.",
  "FEATURE_6": "TypeScript 5.6 Support",
  "FEATURE_6_DESC": "The framework now supports TypeScript 5.6, allowing developers to leverage the latest TypeScript features and improvements.",
  "FEATURE_7": "Zoneless Change Detection (Experimental)",
  "FEATURE_7_DESC": "Angular 19 introduces experimental support for zoneless change detection, aiming to improve performance by reducing reliance on Zone.js.",
  "FEATURE_8": "Improved Angular Language Service",
  "FEATURE_8_DESC": "Enhancements to the Angular Language Service provide better code completion, diagnostics, and navigation within IDEs."
}
